---
kind: method
id: M:Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/f9ff68e8-0b47-002b-b346-41aff62bac38.htm
---
# Autodesk.Revit.Exceptions.RevitServerUnauthenticatedUserException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.